In [2]:
import pandas as pd

In [5]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep = '\s+', header = None)

In [13]:
df_data.head()

df_data.info()

df_data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
0     506 non-null float64
1     506 non-null float64
2     506 non-null float64
3     506 non-null int64
4     506 non-null float64
5     506 non-null float64
6     506 non-null float64
7     506 non-null float64
8     506 non-null int64
9     506 non-null float64
10    506 non-null float64
11    506 non-null float64
12    506 non-null float64
13    506 non-null float64
dtypes: float64(12), int64(2)
memory usage: 55.4 KB

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
dtype: int64

In [16]:
df_data.columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
# column header 지정
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [17]:
import numpy as np
weight_vector = np.array([[1], [1], [1]])
x_vector = np.array([[3], [4], [5]])

In [19]:
# dot product가 numpy의 연산 메소드로 아주 쉽게 계산된다. 행렬의 내적이라고 부른다.
weight_vector.T.dot(x_vector)

array([[12]])

In [21]:
df_matrix = df_data.as_matrix()
weight_vector = np.random.random_sample((14,1))

C:\Users\pulum\AppData\Local\conda\conda\envs\TF_VS_35\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.
  """Entry point for launching an IPython kernel.

In [25]:
print(df_matrix.shape)
print(weight_vector.shape)
print(df_matrix.dot(weight_vector).shape)

(506, 14)
(14, 1)
(506, 1)

In [27]:
# 선형 대수
# 1. Vectors : 수의 순서쌍
a = [1,2]
b = [1,2]
print(a + b)

[1, 2, 1, 2]

In [30]:
# 벡터 간 합(+)연산
a = np.array([1,2])
b = np.array([1,2])
print(a+b)

[2 4]

In [34]:
# 벡터와 스칼라(상수) 곱 연산
lista = [1,2,3,4,5]
scalar_multiply = list(map(lambda x: x*2, lista))
print(scalar_multiply)

lista = np.array([1,2,3,4,5])
lista*2

[2, 4, 6, 8, 10]

array([ 2,  4,  6,  8, 10])

In [36]:
# 벡터의 내적 (Dot Product)
a = np.array([1,2,3,4,5])
b = np.array([2,4,6,8,10])
print(sum(a*b))

110

In [38]:
# 두 벡터 간의 거리
a = np.array([1,2,3,4,5])
b = np.array([2,4,6,8,10])
print(sum((a-b)**2)**(1/2))

7.416198487095663

In [40]:
# n x n 단위행렬
np.diag([1 for _ in range(5)])

array([[1, 0, 0, 0, 0],
       [0, 1, 0, 0, 0],
       [0, 0, 1, 0, 0],
       [0, 0, 0, 1, 0],
       [0, 0, 0, 0, 1]])

In [7]:
import pandas as pd
import numpy as np
s = pd.Series(np.nan, index= [10,9,8,7,1,2,3,4])
print(s.loc[:3]) # loc은 3이라는 index 값으로 인덱싱
print(s.iloc[:3]) # order로 3번째에 오는 값까지 인덱싱

10   NaN
9    NaN
8    NaN
7    NaN
1    NaN
2    NaN
3    NaN
dtype: float64
10   NaN
9    NaN
8    NaN
dtype: float64

In [8]:
df = pd.DataFrame(np.random.randint(1, 10, size = (5,3)), index = range(5), columns = ['a', 'b', 'c'])
df

   a  b  c
0  2  6  9
1  9  7  8
2  6  3  6
3  3  3  3
4  2  4  5

In [10]:
df['new'] = 13
df

   a  b  c  new
0  2  6  9   13
1  9  7  8   13
2  6  3  6   13
3  3  3  3   13
4  2  4  5   13

In [12]:
df['sum_ab'] = df['a'] + df['b']
df

   a  b  c  new  sum_ab
0  2  6  9   13       8
1  9  7  8   13      16
2  6  3  6   13       9
3  3  3  3   13       6
4  2  4  5   13       6

In [14]:
df1 = pd.DataFrame(np.random.randint(1, 10, size=(5,3)), index = range(5), columns = ['a', 'b', 'c' ])
df1

   a  b  c
0  1  1  6
1  2  4  5
2  5  7  7
3  8  5  7
4  5  5  4

In [20]:
df2 = pd.DataFrame(np.random.randint(1, 10, size = (2,3)), index = range(2), columns = ['a', 'b', 'c'])
df2

   a  b  c
0  9  6  4
1  3  8  9

In [22]:
df1.add(df2)

      a     b     c
0  10.0   7.0  10.0
1   5.0  12.0  14.0
2   NaN   NaN   NaN
3   NaN   NaN   NaN
4   NaN   NaN   NaN

In [24]:
df1.add(df2, fill_value=0)

      a     b     c
0  10.0   7.0  10.0
1   5.0  12.0  14.0
2   5.0   7.0   7.0
3   8.0   5.0   7.0
4   5.0   5.0   4.0

In [27]:
s1 = pd.Series(['M', 'M', 'F', 'F', 'M'])
print(s1)
gender = {'M':0, 'F':1}
print(s1.map(gender))

0    M
1    M
2    F
3    F
4    M
dtype: object
0    0
1    0
2    1
3    1
4    0
dtype: int64

In [29]:
s1.replace(gender)

0    0
1    0
2    1
3    1
4    0
dtype: int64

In [31]:
s2 = pd.Series(['M', 'M', 'F', 'E', 'F', 'M', 'F', 'E'])
s2.unique()

array(['M', 'F', 'E'], dtype=object)

In [34]:
dict(enumerate(sorted(s2.unique())))

{0: 'E', 1: 'F', 2: 'M'}

In [ ]:
value =

# refered by https://sacko.tistory.com/50?category=647946